# auth
EMAIL_INPUT_MESSAGE = 'Введи свой корпоративный email и отправь его мне, если ты работаешь в магазине, укажи email магазина 👇'
INVALID_EMAIL_MESSAGE = '⚠️ Неправильный email. Введи, пожалуйста, ещё раз:'
USER_NOT_FOUND_MESSAGE = (
    '⚠️ Пользователь не найден. Повтори ввод или обратись через <b>Запрос доступа</b> к коллегам ИТ'
)
USER_IS_ARCHIVE_MESSAGE = (
    '⛔️ Пользователь недействителен.\n\n'
    '💡 Чтобы начать заново, нажмите /start.'
)
VERIFICATION_EMAIL_SUBJECT = 'Подтверждение учётной записи в чат-боте Telegram'
VERIFICATION_EMAIL_BODY = 'Твой код подтверждения: {}'
VERIFICATION_CODE_SENT_MESSAGE = (
    '📧 На указанный email отправлен код подтверждения. '
    'Проверь почту и введи код:'
)
VERIFICATION_CODE_EXPIRED_MESSAGE = (
    '⚠️ Истёк срок действия кода подтверждения.'
)
INVALID_VERIFICATION_CODE_MESSAGE = (
    '⚠️ Неверный код подтверждения. Введи ещё раз:'
)
VERIFICATION_LIMIT_EXCEEDED_MESSAGE = (
    '⛔️ Превышен лимит ввода кода подтверждения.\n\n'
    '💡 Чтобы начать заново, нажми /start.'
)
VERIFICATION_ERROR_MESSAGE = '⛔️Что-то пошло не так. Повторите регистрацию.'

# service
SELECT_SERVICE_MESSAGE = '📋 Выбери сервис:'
SELECT_TASK_TYPE_MESSAGE = '📋 Выбери тип заявки:'
SERVICE_NOT_FOUND_MESSAGE = (
    '⚠️ Не удалось найти сервис по QR коду.\n\n'
    '💡 Чтобы выбрать сервис вручную, нажми 🛎️ Сервисы создания заявок.'
)
SERVICE_FOUND_MESSAGE = (
    '🎯 Найден сервис {}.\n\n'
    '💡 Чтобы выбрать сервис вручную, нажми 🛎️ Сервисы создания заявок.'
)

# task
NEW_TASK_MESSAGE = (
    '📥 Ты создаёшь заявку в сервисе {}. '
    'Если ты ошибся или хочешь прекратить создание заявки, нажми /cancel.'
)
TASK_CONFIRMATION_MESSAGE = '📤 Заявка заполнена. Отправить?'
TASK_SUCCESS_MESSAGE = '🎯 Успешно создана заявка №{}.'
TASK_CANCEL_MESSAGE = '❌ Заявка отменена.'
CREATE_TASK_MESSAGE = 'Чтобы создать заявку, выберите 🛎️ Сервисы создания заявок.'
PERMISSION_ERROR_TASK_CREATE_MESSAGE = 'Ты не можешь создавать заявки в этом сервисе 😕 Попробуй создать в другом или обратись к руководителю.'
CREATE_ANOTHER_TASK_MESSAGE = (
    'Чтобы создать ещё одну заявку, выбери 🛎️ Сервисы создания заявок.'
)
NOT_EXISTING_SERVICE = 'Сервис не существует или перенесён в архив.'
ATTCH_FILES_MESSAGE = '📎 Прикрепить файл(ы)?'
UPLOAD_FILE_MESSAGE = '📎 Теперь загрузи файл или группу файлов и подожди ответа:'
ATTACH_MORE_FILES_MESSAGE = '📎 Прикрепить ещё файл(ы)?'

# inputs
INVALID_TEXT_MESSAGE = (
    '⚠️ Пожалуйста, используй только текст. Введите ещё раз:'
)
INVALID_FLOAT_NUMBER_MESSAGE = (
    '⚠️ Пожалуйста, используй только цифры и запятую. Введите ещё раз:'
)
INVALID_NUMBER_MESSAGE = '️⚠️ Пожалуйста, используй только цифры. Введи ещё раз:'
INVALID_DATE_MESSAGE = (
    '⚠️ Пожалуйста, используй только цифры и точки (например, 01.01.1970). '
    'Введи ещё раз:'
)

# selections
OPTIONAL_FIELD_MESSAGE = '📝 {} (необязательное поле):\nЗаполнить?'
SELECT_CHECKBOX_MESSAGE = '🔘 Выбери вариант:'
SELECT_LIST_MESSAGE = '📋 Выбери из списка:'
SELECT_CHOICE_MESSAGE = (
    '📋 Выбери из списка один или несколько вариантов:\n\n'
    '💡 Чтобы завершить выбор и продолжить заполнение заявки, '
    'нажми ✅ Завершить выбор.'
)
SELECTED_MESSAGE = '✔️ {}'
ALREADY_SELECTED_MESSAGE = '⚠️ Вариант {} уже выбран.'
NOT_SELECTED_MESSAGE = '⚠️ Необходимо выбрать хотя бы один вариант.'

# other
WELCOME_MESSAGE = """
👋 Приветствую, {}! Теперь тебе доступны все возможности виртуального помощника! ✨
⚡️ Закрепи наш с тобой чат для удобства 📌 и погнали!
Я умею отвечать на вопросы и создавать заявки в IntraService. Заявки также можно отправлять через [сайт](https://help.inventive.ru/)
"""
START_MESSAGE = """
Привет! 👋 Ты на связи с виртуальным помощником - <b>Технослав!</b>
🖥️✨ Я всегда здесь, чтобы помочь тебе 24/7.
Не стесняйся задавать вопросы. Давай сделаем твою работу проще и продуктивнее! 🚀
А еще буду уведомлять тебя о важных событиях.
⚡ Для начала работы нажми <b>Войти</b> и отправь <b>email корпоративный или магазина</b>.

☝️ После авторизации ты принимаешь пользовательское соглашение, ознакомься с ним.

© Inventive Retail Group
"""
ANTIFLOOD_MESSAGE = (
    '⚠️ Слишком частые сообщения.\n'
    'Подожди, прежде чем отправить ещё одно сообщение.'
)
FILE_SIZE_LIMIT_EXCEEDED_MESSAGE = (
    '⚠️ Размер одного или нескольких файлов превышает {} МБ. Пожалуйста, загрузи файл меньшего размера.'
)
TOTAL_UPLOAD_SIZE_LIMIT_EXCEEDED_MESSAGE = (
    '⚠️ Превышен лимит загрузки файлов.'
)
SESSION_EXPIRED_MESSAGE = (
    '⛔️ Ты не авторизован или время твоей сессии истекло. '
    'Пожалуйста, начни заново.\n\n'
    '💡 Чтобы начать заново, нажми /start.'
)
SERVICE_UNAVAILABLE_MESSAGE = (
    '⛔️ Сервис временно недоступен. Попробуй позже.'
)
EMAIL_SEND_ERROR_MESSAGE = (
    '⛔️ Возникла ошибка при отправке email. Попробуй позже.'
)
NEW_TASK_ERROR_MESSAGE = '⛔️ Создание заявки в выбранном сервисе невозможно.'
TASK_ERROR_MESSAGE = (
    '🆘 Возникла ошибка при создании заявки. Обратись в службу поддержки.'
)
CREATE_TASK_ERROR_MESSAGE = (
    '🆘 Возникла ошибка при отправке заявки. Обратись в службу поддержки.'
)
GENERAL_ERROR_MESSAGE = (
    '🆘 Упс... Что-то пошло не так.\n\n'
    '💡 Чтобы начать заново, нажми /start.'
)
APOLOGIZE_MESSAGE = 'Прошу прощения - проводим ИТ профилактику бота...'

TEXT_STOP_COUNT = '🥁 ты исчерпал лимит вопросов за день. Пожалуйста, подожди полуночи, в полночь обнулится лимит 🚀'
EMPTY_MESSAGE = 'Ты ничего не написал... Отправь сообщение повторно.'
ANSWER_FEEDBACK_MESSAGE = 'Передал коллегам в ИТ, чтобы меня отремонтировали '

LIST_PAUSE = ['обдумываю, секунду...',
              'сейчас найду необходимую информацию...',
              'сейчас сверюсь с актуальными данными...',
              'подождите чуть-чуть, подумаю, как лучше ответить...',
              'сейчас найду нужную информацию.',
              'понял, 5 сек...',
              'сейчас предложу тебе варианты...',
              'обдумаю, пара секунд...',
              'понял, сейчас подумаю...',
              'так, понятно, формирую ответ...',
              'ищу нужную информацию, минутку...',
              'подожди секунду, анализирую...',
              'услышал тебя, секунду...',
              'сейчас предложу, что будет наилучшим вариантом...',
              'понял, посоветуюсь с коллегой, минутку...',
              'ищу инфо, минутку...',
              'ясно, сейчас подумаю...',
              'секундочку, уже занимаюсь вопросом...',
              'анализирую, дай пару секунд...']

LIST_EMOJI_GOOD = ['😀 спасибо за положительный отзыв!',
                   '😄 благодарю!',
                   '🙃 благодарю за высокую оценку!',
                   '🙂 приятно получать такую оценку!',
                   '🤓 спасибо за доверие! ',
                   '🥳 приятно знать, что моя работа оценена!',
                   '🤩 спасибо, это вдохновляет!',
                   '🥸 рад, что смог помочь!',
                   '😎 огонь, пожар, спасибо!',
                   '🙌 оценка значит многое для меня!',
                   '🫶 я стремился помочь!',
                   '🦾 это придаёт сил, мерси!',
                   '🤝 рад, что оправдал ожидания!',
                   '🤜🤛 это было здорово, спасибо!']

LIST_EMOJI_BAD = ['🧐 ох, приму к сведению. ',
                  '😞 извини, учту на будущее. ',
                  '😕 понял, исправлюсь. ',
                  '😮‍💨 упс. ',
                  '🥶 постараюсь сделать лучше. ',
                  '😳 буду рад исправить свои недочёты. ',
                  '🫣 прошу прощения. ',
                  '🤔 хм, буду работать над собой. ',
                  '😬 что-то пошло не так. ',
                  '🙄 ладно, учту. ',
                  '🤦 постараюсь сделать лучше в следующий раз. ',
                  '😵‍💫 какая-то ошибка, очень жаль. ',
                  '😲 приму во внимание. ',
                  '😱 буду работать над ошибками. ']

TEXT_RECOGNIZE_MESSAGE = 'Хорошо, распознаю текст и дам ответ, секунду...'
TEXT_RECOGNIZE_NOT_DONE_MESSAGE = 'Идёт обработка голосового сообщения. Повтори попытку чуть позже.'

BAD_REACTION_MESSAGE = 'Если ответ тебя не удовлетворил или не помог: оправь текстовые или голосовые сообщения и нажми <b>Оставить отзыв</b>. Твои замечания помогут улучшить мои ответы. Спасибо!'
ERROR_GENERATE_ANSWER = 'Произошла ошибка при обработке Вопроса. Пожалуйста, отправь сообщение повторно.'

ERROR_SUBJECT = 'Ошибка работы бота!'
ERROR_EMAIL_MESSAGE = 'Ошибка работы с LLM и БЗ. User id: {}. Вопрос пользователя: {}. Ошибка: {}'

REQUEST_ACCESS = 'Напиши email для которого нужен доступ.'
RESPONSE_ACCESS = 'Сообщение передано в техническую поддержку.'
ACCESS_SUBJECT = 'Запрос доступа в TELEGRAM IT BOT'

FEEDBACK_BOT_SUBJECT = 'Фидбэк о TELEGRAM IT BOT'
FEEDBACK_BOT_REQUEST = 'Отправь сообщение с фидбэком о боте.'
FEEDBACK_BOT_RESPONSE = 'Благодарю! Твой фидбэк передан в техническую поддержку.'

TIMEZONE_MESSAGE = 'Выбери свой часовой пояс из списка. Твой текущий часовой пояс: {}'
TIMEZONE_CHANGED = 'Твой часовой пояс успешно изменён на {}'

# ADMIN PANEL
ADMIN_PANEL = "Панель администратора."
ONLY_ADMIN_ACCESS = 'Доступно только для администратора бота.'
ADD_ADMIN_EMAIL_INPUT = 'Введи Inventive email пользователя, которого хочешь сделать администратором.'
REMOVE_ADMIN_EMAIL_INPUT = 'Введи Inventive email пользователя, у которого хочешь забрать права администратора.'
SUCCESSFULLY_CHANGE_USER_ROLE = 'Роль пользователя {} была успешно изменена.'
UNSUCCESSFULLY_CHANGE_USER_ROLE = 'Не удалось изменить роль пользователя {}: возможно, пользователь не существует или уже имеет эту роль.'

# TESTING
GET_SHEET_URL = 'Для тестирования ответов бота отправь сообщение с ссылкой на google sheet с вопросами.'
GET_SHEET_NAME = 'Отправь сообщение с названием листа в таблице для тестирования.'
WAITING_MESSAGE_WHILE_TESTING = 'Пожалуйста подожди. Я сообщу, как тестирование закончится.'
SUCCESSFULLY_FINISHED_TESTING = 'Тестирование успешно завершилось. Данные в Google таблице обновлены!'
ERROR_WHILE_TESTING = 'Произошла ошибка: {}'

NEW_PARAMETER = 'Ты выбрал изменение параметра - {}, текущее значение = {}, тип данных параметра - {}. Чтобы изменить параметр - отправь мне новый параметр.'
SUCCESSFULLY_VALIDATED_PARAMETER = 'Ты поменял параметр - {} = <b>{}</b>'
UNSUCCESSFULLY_VALIDATED_PARAMETER = 'Ты ввел недопустимое значение (верный тип - {}), повтори ввод, пока мы оставили текущее значение в параметре {} = {}'
SUCCESSFULLY_CHANGE_PARAMETER = 'Параметр применен!'
UNSUCCESSFULLY_CHANGE_PARAMETER = 'Ты ввел недопустимое значение (верный тип - {}), повтори ввод, пока мы оставили текущее значение в параметре {} = {}'
CANCEL_CHANGE_PARAMETER = 'Параметр оставлен прежним.'

SUCCESSFULLY_CHANGED_STT_MODEL = 'Модель Speak to text изменена на {}'

APPLY_PROMPT = 'Ты уверен, что хочешь обновить промпты? Они будут автоматически скачены из Teamly.'
UPDATE_PROMPTS = 'Синхронизация промптов бота с Teamly. Вы уверены? [Ссылка на источник промтов](https://knowledge.inventive.ru/space/27165257-ab72-4dae-819c-6f683d5315d7/database/9ed53d81-67e4-4be9-9af5-838687015720)'
PROMPTS_UPDATED = 'Промпты обновлены.'

TIME_SELECTION = 'Выбери время рассылки'
BROADCAST_MESSAGE_INPUT = 'Введи текст сообщения, которое появится у пользователей, выдели символами **текст** где необходимо вывести жирным или __текст__ для выделения курсивом.'
BROADCAST_MESSAGE_WAITING = 'Твое сообщение рассылается пользователям бота. Ты будешь уведомлен по окончании.'
BROADCAST_RESULT_MESSAGE = 'Сообщение было разослано пользователям. \nУспешно: <b>{}</b>. \nНе удалось отправить: <b>{}</b>'
BROADCAST_CREATED = 'Сообщение будет разослано пользователям согласно рабочему графику в {}'

# Работа с опросниками
GET_QUESTION_SURVEY = 'Введи сообщение - описание опроса.'
GET_SURVEY_CHOICES = 'Введи варианты ответов и раздели их символом #:'
GET_MAX_NUMBER_CHOICES = 'Введи максимальное количество вариантов ответов:'
INCORRECT_MAX_NUMBER_CHOICES = 'Введи корректное число от 0 до количества вариантов: '
SELECT_SURVEY_START_DATE = 'Выбери дату начала рассылки опроса.'
SELECT_SURVEY_END_DATE = 'Выбери дату завершения опроса.'
SURVEY_CREATED = 'Опрос успешно создан под номером: {}'

SURVEY_IS_FINISHED = 'Опрос уже завершён.'
SURVEY_ALREADY_PASSED = 'Ты уже прошел данный опрос.'
REACHED_MAX_SELECT_CHOICES = 'Ты достиг максимум вариантов выбора. Для отмены выбора повторно нажми на кнопку.'
NOT_SELECTED_CHOICES = 'Выбери хотя бы 1 вариант ответа.'
SURVEY_COMPLETED = 'Спасибо, {}! Мы ценим твое мнение.'
NEW_SURVEY_EMAIL_MESSAGE = """
    Ты создал опрос с ID: {}. 
    Для получения результатов опроса в панели администратора бота выбери "Рассылка сообщения" -> "Получить результаты опроса".
"""
REQUEST_SURVEY_ID = 'Отправь сообщение с ID опроса для получения результата опроса.'
RESULT_SURVEY_MESSAGE = 'Результаты опроса №{} - {}:\n{}'
REMAINDER_SURVEY_MESSAGE = 'Опрос закончится через {}. Нам важно твое мнение.\n'
SURVEY_REPORT_NOT_READY = 'Опрос №{} - {}.\n\nПока нет голосов.'

# Изменение сообщения и опросов для рассылки
DELETE_BROADCAST_SUCCESS = 'Рассылка удалена!'
REQUEST_NEW_BROADCAST_MESSAGE_TEXT = 'Отправь сообщение с новым текстом для рассылки.'
BROADCAST_MESSAGE_UPDATED = 'Сообщение для рассылки успешно обновлено!'
EDIT_BROADCAST_MESSAGE_ERROR = 'Ошибка изменения рассылки сообщения. Сообщение не найдено.'

REQUEST_NEW_SURVEY_QUESTION = 'Введи новую тему опроса.'
SURVEY_START_DATE_SELECTION = 'Выбери дату рассылки опроса!'
SURVEY_END_DATE_SELECTION = 'Выбери дату завершения опроса!'
SURVEY_UPDATED = 'Опрос успешно изменён!'
REQUEST_MAX_CHOICES_NUMBER = 'Введи максимальное количество ответов.'
SAME_MAX_CHOICES_NUMBER = 'Максимальное количество ответов не должно совпадать со старым значением. Введи другое число:'

ABOUT = """Технослав — твой виртуальный помощник 🤖 Он доступен 24/7, быстро обрабатывает голосовые и текстовые сообщения и решает задачи за 5–20 сек. Вот что он умеет:
1. Отвечать на вопросы по ИТ-тематике.
2. Помогать с настройкой оборудования.
3. Оказывать поддержку в решении технических проблем.
4. Консультировать по вопросам безопасности.
5. Обучать работе с новыми функциями и программами.
6. Помогать с решением проблем в 1С:Рознице.
7. Присылать важные уведомления.
8. Помогать с проведением опросов.
9. Подсказывать, нужна ли заявка по конкретному вопросу.
10. Помогать с созданием заявок сразу в нужном сервисе.
11. Предлагать ссылки на статьи с дополнительной информацией по теме.
Чат-бот интегрирован с нашими базами знаний и всегда готов помочь. Ставь его ответам лайки или дизлайки, а также делись с нами идеями и замечаниями по его работе, и вместе мы сделаем этого виртуального помощника ещё лучше!
© Inventive Retail Group.
"""

SELECT_START_DATE_COLLECT_STATISTICS = 'Выбери дату начала сбора статистики'
SELECT_END_DATE_COLLECT_STATISTICS = 'Выбери дату окончания сбора статистики'
